lib/xml/deleteRecordFromList.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:deleteRecordFromList>
            <!--Optional:-->
            <listName>?</listName>
            <!--Optional:-->
            <listDeleteSettings>
                <!--Optional:-->
                <allowDataCleanup>?</allowDataCleanup>
                <!--Optional:-->
                <callbackFormat>?</callbackFormat>
                <!--Optional:-->
                <callbackUrl>?</callbackUrl>
                <!--Optional:-->
                <countryCode>?</countryCode>
                <!--Optional:-->
                <failOnFieldParseError>?</failOnFieldParseError>
                <!--Zero or more repetitions:-->
                <fieldsMapping>
                    <columnNumber>?</columnNumber>
                    <!--Optional:-->
                    <fieldName>?</fieldName>
                    <key>?</key>
                </fieldsMapping>
                <!--Optional:-->
                <reportEmail>?</reportEmail>
                <!--Optional:-->
                <separator>?</separator>
                <skipHeaderLine>?</skipHeaderLine>
                <!--Optional:-->
                <listDeleteMode>?</listDeleteMode>
            </listDeleteSettings>
            <!--Optional:-->
            <record>
                <!--Zero or more repetitions:-->
                <fields>?</fields>
            </record>
        </ser:deleteRecordFromList>
    </soapenv:Body>
</soapenv:Envelope>